#vi:ft=ruby:
tap 'homebrew/services'

brew 'bash-completion'
brew 'ctags'
brew 'curl'
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'go'
brew 'hub'
brew 'neovim', args: %w[HEAD]
brew 'nvm'
brew 'openssl'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'git-crypt'
brew 'pipenv'

tap 'caskroom/cask'
cask '1password'
cask 'alfred'
cask 'calibre'
cask 'docker'
cask 'etcher'
cask 'firefox'
cask 'flux'
cask 'gpg-suite'
cask 'iterm2'
cask 'reaper'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'keka'
cask 'opera'
