#vi:ft=ruby:
tap 'homebrew/services'

brew 'bash-completion'
brew 'curl'
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'go'
brew 'goenv'
brew 'pipenv'
brew 'pyenv'
brew 'hub'
brew 'neovim', args: %w[HEAD]
brew 'nvm'
brew 'openssl'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'git-crypt'
brew 'git-delta'
brew 'jq'
brew 'yq'
brew 'eza'
brew 'bat'
brew 'bat-extras'
brew 'urlview'
brew 'starship'
brew 'gh'
brew 'procs'
brew 'stylua'
brew 'hashicorp/tap/terraform-ls'
brew 'rust-analyzer'
brew 'tflint'

cask '1password'
cask 'alacritty'
cask 'spotify'
cask 'visual-studio-code'
cask 'font-hack-nerd-font'
cask 'amethyst' # tiling window manager
