#vi:ft=ruby:
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'universal-ctags/universal-ctags'

brew 'ag'
brew 'bash-completion'
brew 'curl'
brew 'fasd'
brew 'ffmpeg', args: %w[--with-libvpx --with-libvorbis]
brew 'git'
brew 'go'
brew 'hub'
brew 'neovim', args: %w[HEAD]
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'rust'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: %w[HEAD]
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

tap 'caskroom/cask'
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'calibre'
cask 'charles'
cask 'daisydisk'
cask 'dash'
cask 'docker'
cask 'etcher'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'gpg-suite'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'reaper'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
